UT_Marketplaces.Marketplaces/src/InformationRegisters/рар_мп_СопоставленныеСклады/рар_мп_СопоставленныеСклады.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>рар_мп_СопоставленныеСклады</name>
  <resources>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </resources>
  <attributes>
    <name>НазваниеСкладаНаМаркетплейсе</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>рар_мп_ЯМ_campaignId</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>АккаунтМаркетплейса</name>
    <type>
      <types>CatalogRef.рар_мп_АккаунтыМаркетплейсов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>УникальныйИдентификаторСклада</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

UT_Marketplaces.Marketplaces/src/CommonModules/рар_мп_СопоставлениеСкладов/Module.bsl
#Область Ozon

Функция ПолучитьСписокСкладов_Ozon(Аккаунт) Экспорт

	Запрос = рар_мп_Ozon_Методы.Метод_СписокСкладов(Аккаунт);
	
	КодЗапроса = Запрос.КодСостояния; 
	
	ТЗ = Новый ТаблицаЗначений;
	
	ТЗ.Колонки.Добавить("УникальныйИдентификаторСклада", Новый ОписаниеТипов("Строка"));
	ТЗ.Колонки.Добавить("НазваниеСклада", Новый ОписаниеТипов("Строка"));
	
	Если Запрос.Свойство("ОтветAPI") Тогда
	
		Если КодЗапроса = 200 Тогда
		
			Попытка
			
				СписокСкладов = Запрос.ОтветAPI.result;
				
				Для каждого Стр Из СписокСкладов Цикл
					
					УникальныйИдентификаторСклада = СтрЗаменить(Стр.warehouse_id, Символы.НПП, "");
					
					Запись = РегистрыСведений.рар_мп_СопоставленныеСклады.СоздатьМенеджерЗаписи();
					
					Запись.АккаунтМаркетплейса = Аккаунт;
					
					Запись.УникальныйИдентификаторСклада = УникальныйИдентификаторСклада;
					
					Запись.Прочитать();

					Если НЕ Запись.Выбран() Тогда
			
						НоваяСтрока = ТЗ.Добавить();
						
						НоваяСтрока.УникальныйИдентификаторСклада = УникальныйИдентификаторСклада;
						
						НоваяСтрока.НазваниеСклада = Стр.name;
						
					КонецЕсли;
				
				КонецЦикла; 
				
				Возврат ТЗ;
			
			Исключение
				
				ТЗ.Очистить();
				
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = СтрШаблон("Ошибка при получении данных о складах. Подробное описание ошибки можно посмотреть в журнале регистрации", КодЗапроса);
				Сообщение.Сообщить();
				
				ЗаписьЖурналаРегистрации("Ошибка при получении данных о складах", УровеньЖурналаРегистрации.Ошибка,,,СтрШаблон("Аккаунт: %3. Код запроса:%1. Описание ошибки:%2", КодЗапроса, ОписаниеОшибки(), Аккаунт),);
				
				Возврат ТЗ;
			
			КонецПопытки;
		
				
			
		Иначе
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = СтрШаблон("Ошибка при получении данных о складах. Код ошибки: %1. Подробное описание ошибки можно посмотреть в журнале регистрации", КодЗапроса);
			Сообщение.Сообщить();
			
			ЗаписьЖурналаРегистрации("Ошибка при получении данных о складах", УровеньЖурналаРегистрации.Ошибка,,,СтрШаблон("Аккаунт: %3. Код запроса:%1. Описание ошибки:%2", КодЗапроса, Запрос.ОтветAPI.message, Аккаунт),);
			
			Возврат ТЗ;
			
		
		КонецЕсли;	
	
	Иначе
	
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Ошибка при получении данных о складах. Подробное описание ошибки можно посмотреть в журнале регистрации";
		Сообщение.Сообщить();
		
		Комментарий = "Ошибка при получении JSON. Некорректные значения JSON";
		
		ЗаписьЖурналаРегистрации("Ошибка при получении данных о складах", УровеньЖурналаРегистрации.Ошибка,,,СтрШаблон("Аккаунт: %3. Код запроса:%1. Описание ошибки:%2", КодЗапроса, Комментарий, Аккаунт),);
		
		Возврат ТЗ;	
	
	КонецЕсли;
		

КонецФункции

#КонецОбласти

#Область ЯндексМаркет

Функция ПолучитьСписокСкладов_ЯндексМаркет(Аккаунт) Экспорт
	
	Запрос = рар_мп_ЯндексМаркет_Методы.Метод_СписокСкладов(Аккаунт);
	
	КодЗапроса = Запрос.КодСостояния; 
	
	ТЗ = Новый ТаблицаЗначений;
	
	ТЗ.Колонки.Добавить("УникальныйИдентификаторСклада", Новый ОписаниеТипов("Строка"));
	ТЗ.Колонки.Добавить("НазваниеСклада", Новый ОписаниеТипов("Строка"));
	ТЗ.Колонки.Добавить("CampaignId", Новый ОписаниеТипов("Строка"));
	
	Если Запрос.Свойство("ОтветAPI") Тогда
		
		Если КодЗапроса = 200 Тогда
			
			Попытка
			
				СписокСкладов = Запрос.ОтветAPI.result.warehouses;
				
				Для каждого Стр Из СписокСкладов Цикл
					
					УникальныйИдентификаторСклада = СтрЗаменить(Стр.id, Символы.НПП, "");
					
					CampaignId = СтрЗаменить(Стр.campaignId, Символы.НПП, "");
					
					Запись = РегистрыСведений.рар_мп_СопоставленныеСклады.СоздатьМенеджерЗаписи();
					
					Запись.АккаунтМаркетплейса = Аккаунт;
					
					Запись.УникальныйИдентификаторСклада = УникальныйИдентификаторСклада;
					
					Запись.Прочитать();

					Если НЕ Запись.Выбран() Тогда
			
						НоваяСтрока = ТЗ.Добавить();
						
						НоваяСтрока.УникальныйИдентификаторСклада = УникальныйИдентификаторСклада;
						
						НоваяСтрока.НазваниеСклада = Стр.name;
						
						НоваяСтрока.CampaignId = CampaignId;
						
					КонецЕсли;
				
				КонецЦикла;
				
				ГруппаСкладов = Запрос.ОтветAPI.result.warehouseGroups;
				
				Для каждого Стр Из ГруппаСкладов Цикл
				
					СписокСкладов = Стр.warehouses;
					
					Для каждого Стр Из СписокСкладов Цикл
					
						УникальныйИдентификаторСклада = СтрЗаменить(Стр.id, Символы.НПП, "");
						
						CampaignId = СтрЗаменить(Стр.campaignId, Символы.НПП, "");
						
						Запись = РегистрыСведений.рар_мп_СопоставленныеСклады.СоздатьМенеджерЗаписи();
						
						Запись.АккаунтМаркетплейса = Аккаунт;
						
						Запись.УникальныйИдентификаторСклада = УникальныйИдентификаторСклада;
						
						Запись.Прочитать();

						Если НЕ Запись.Выбран() Тогда
				
							НоваяСтрока = ТЗ.Добавить();
							
							НоваяСтрока.УникальныйИдентификаторСклада = УникальныйИдентификаторСклада;
							
							НоваяСтрока.НазваниеСклада = Стр.name;
							
							НоваяСтрока.CampaignId = CampaignId;
							
						КонецЕсли;
					
					КонецЦикла;
				
				КонецЦикла;
				
				Возврат ТЗ;
			
			Исключение
				
				ТЗ.Очистить();
				
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = СтрШаблон("Ошибка при получении данных о складах. Подробное описание ошибки можно посмотреть в журнале регистрации", КодЗапроса);
				Сообщение.Сообщить();
				
				ЗаписьЖурналаРегистрации("Ошибка при получении данных о складах", УровеньЖурналаРегистрации.Ошибка,,,СтрШаблон("Аккаунт: %3. Код запроса:%1. Описание ошибки:%2", КодЗапроса, ОписаниеОшибки(), Аккаунт),);
				
				Возврат ТЗ;
			
			КонецПопытки;
		
				
			
		Иначе
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = СтрШаблон("Ошибка при получении данных о складах. Код ошибки: %1. Подробное описание ошибки можно посмотреть в журнале регистрации", КодЗапроса);
			Сообщение.Сообщить();
			
			ЗаписьЖурналаРегистрации("Ошибка при получении данных о складах", УровеньЖурналаРегистрации.Ошибка,,,СтрШаблон("Аккаунт: %3. Код запроса:%1. Описание ошибки:%2", КодЗапроса, Запрос.ОтветAPI.errors.Получить(0).message, Аккаунт),);	
			
			Возврат ТЗ;
			
		
		КонецЕсли;
		
	Иначе
	
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Ошибка при получении данных о складах. Подробное описание ошибки можно посмотреть в журнале регистрации";
		Сообщение.Сообщить();
		
		Комментарий = "Ошибка при получении JSON. Некорректные значения JSON";
		
		ЗаписьЖурналаРегистрации("Ошибка при получении данных о складах", УровеньЖурналаРегистрации.Ошибка,,,СтрШаблон("Аккаунт: %3. Код запроса:%1. Описание ошибки:%2", КодЗапроса, Комментарий, Аккаунт),);
		
		Возврат ТЗ;	
	
	КонецЕсли;

КонецФункции

#КонецОбласти

#Область Wildberries

Функция ПолучитьСписокСкладов_Wildberries(Аккаунт) Экспорт

	Запрос = рар_мп_Wildberries_Методы.Метод_ПолучитьСписокСкладовПродавца(Аккаунт);
	
	КодЗапроса = Запрос.КодСостояния; 
	
	ТЗ = Новый ТаблицаЗначений;
	
	ТЗ.Колонки.Добавить("УникальныйИдентификаторСклада", Новый ОписаниеТипов("Строка"));
	ТЗ.Колонки.Добавить("НазваниеСклада", Новый ОписаниеТипов("Строка"));
	
	Если Запрос.Свойство("ОтветAPI") Тогда
		
		Если КодЗапроса = 200 Тогда
			
			Попытка
				
				Для каждого Стр Из Запрос.ОтветAPI Цикл
					
					УникальныйИдентификаторСклада = СтрЗаменить(Стр.id, Символы.НПП, "");
					
					Запись = РегистрыСведений.рар_мп_СопоставленныеСклады.СоздатьМенеджерЗаписи();
					
					Запись.АккаунтМаркетплейса = Аккаунт;
					
					Запись.УникальныйИдентификаторСклада = УникальныйИдентификаторСклада;
					
					Запись.Прочитать();

					Если НЕ Запись.Выбран() Тогда
			
						НоваяСтрока = ТЗ.Добавить();
						
						НоваяСтрока.УникальныйИдентификаторСклада = УникальныйИдентификаторСклада;
						
						НоваяСтрока.НазваниеСклада = Стр.name;
						
					КонецЕсли;
				
				КонецЦикла; 
				
				Возврат ТЗ;
			
			Исключение
				
				ТЗ.Очистить();
				
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = "Ошибка при получении данных о складах. Подробное описание ошибки можно посмотреть в журнале регистрации";
				Сообщение.Сообщить();
				
				ЗаписьЖурналаРегистрации("Ошибка при получении данных о складах", УровеньЖурналаРегистрации.Ошибка,,,
										  СтрШаблон("Аккаунт: %3. Код запроса:%1. Описание ошибки:%2", КодЗапроса, ОписаниеОшибки(), Аккаунт),);
				
				Возврат ТЗ;
			
			КонецПопытки;
		
				
			
		Иначе
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = СтрШаблон("Ошибка при получении данных о складах. 
										|Код ошибки: %1. Подробное описание ошибки можно посмотреть в журнале регистрации", КодЗапроса);
			Сообщение.Сообщить();
			
			Если Запрос.ОтветAPI.Свойство("message") Тогда
			
				ОписаниеОшибки = Запрос.ОтветAPI.message;	
			
			Иначе
			
				ОписаниеОшибки = Запрос.ОтветAPI.detail;	
			
			КонецЕсли;
			
			ЗаписьЖурналаРегистрации("Ошибка при получении данных о складах", УровеньЖурналаРегистрации.Ошибка,,,
										 СтрШаблон("Аккаунт: %3. Код запроса:%1. Описание ошибки:%2", КодЗапроса, ОписаниеОшибки, Аккаунт),);	
			
			Возврат ТЗ;
			
		
		КонецЕсли;
		
	Иначе
	
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Ошибка при получении данных о складах. Подробное описание ошибки можно посмотреть в журнале регистрации";
		Сообщение.Сообщить();
		
		Комментарий = "Ошибка при получении JSON. Некорректные значения JSON";
		
		ЗаписьЖурналаРегистрации("Ошибка при получении данных о складах", УровеньЖурналаРегистрации.Ошибка,,,СтрШаблон("Аккаунт: %3. Код запроса:%1. Описание ошибки:%2", КодЗапроса, Комментарий, Аккаунт),);
		
		Возврат ТЗ;	
	
	КонецЕсли;

КонецФункции

#КонецОбласти

#Область СохранениеСопоставления

Функция СохранениеСопоставления(СопоставлениеСкладов, АккаунтМаркетплейса) Экспорт

	ВыбранныеСтроки = СопоставлениеСкладов.НайтиСтроки(Новый Структура("ВыборСтроки", Истина));
	
	Если ВыбранныеСтроки.Количество() = 0 Тогда
	
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не выбрано ни одной строки для сохранения сопоставления складов";
		Сообщение.Сообщить();
		
	Иначе
			
		Для каждого Стр Из ВыбранныеСтроки Цикл
		
			Если ЗначениеЗаполнено(Стр.Склад) Тогда
			
				МенеджерЗаписи = РегистрыСведений.рар_мп_СопоставленныеСклады.СоздатьМенеджерЗаписи(); 
				МенеджерЗаписи.АккаунтМаркетплейса = АккаунтМаркетплейса; 
				МенеджерЗаписи.УникальныйИдентификаторСклада = Стр.УникальныйИдентификаторСклада; 
				МенеджерЗаписи.Склад = Стр.Склад;
				МенеджерЗаписи.рар_мп_ЯМ_campaignId = Стр.campaignId;
				МенеджерЗаписи.НазваниеСкладаНаМаркетплейсе = Стр.НазваниеСклада;
				
				Попытка
				
					МенеджерЗаписи.Записать();
					
					СопоставлениеСкладов.Удалить(СопоставлениеСкладов.Индекс(Стр));
				
				Исключение
					
					Сообщение = Новый СообщениеПользователю;
					Сообщение.Текст = СтрШаблон("Ошибка при сопоставлении склада с уникальным идентификатором: %1 и названием: %2. 
												|Продробную ошибку можно посмотреть в журнале регистрации", 
												Стр.УникальныйИдентификаторСклада, Стр.НазваниеСклада);
					Сообщение.Сообщить();
					
					ЗаписьЖурналаРегистрации(СтрШаблон("Ошибка при сопоставлении склада с уникальным идентификатором: %1 и названием: %2", 
														Стр.УникальныйИдентификаторСклада, Стр.НазваниеСклада), УровеньЖурналаРегистрации.Ошибка,,,ОписаниеОшибки(),);
				
				КонецПопытки;
				    			
			
			Иначе
			
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = СтрШаблон("Не удалось сохранить сопоставление так как не указано значение в поле 'Склад' для склада 
											|с уникальным идентификатором: %1 и названием: %2", Стр.УникальныйИдентификаторСклада, Стр.НазваниеСклада);
				Сообщение.Сообщить();	
			
			КонецЕсли;
		
		КонецЦикла;
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Сохранение сопоставления складов завершено";
		Сообщение.Сообщить();
		
	КонецЕсли;
	
	Возврат СопоставлениеСкладов;

КонецФункции

#КонецОбласти 

#Область УдалениеСопоставления

Функция УдалениеСопоставления(СопоставленныеСклады, АккаунтМаркетплейса) Экспорт

	ВыбранныеСтроки = СопоставленныеСклады.НайтиСтроки(Новый Структура("ВыборСтроки", Истина));
	
	Если ВыбранныеСтроки.Количество() = 0 Тогда
	
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не выбрано ни одной строки для удаления сопоставления складов";
		Сообщение.Сообщить();
		
	Иначе
			
		Для каждого Стр Из ВыбранныеСтроки Цикл
			
			МенеджерЗаписи = РегистрыСведений.рар_мп_СопоставленныеСклады.СоздатьМенеджерЗаписи(); 
			МенеджерЗаписи.АккаунтМаркетплейса = АккаунтМаркетплейса; 
			МенеджерЗаписи.УникальныйИдентификаторСклада = Стр.УникальныйИдентификаторСклада; 
			
			Попытка
			
				МенеджерЗаписи.Удалить();
				
				СопоставленныеСклады.Удалить(СопоставленныеСклады.Индекс(Стр));
			
			Исключение
				
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = СтрШаблон("Ошибка при удалении сопоставления склада с уникальным идентификатором: %1 и названием: %2. 
											|Продробную ошибку можно посмотреть в журнале регистрации", 
											Стр.УникальныйИдентификаторСклада, Стр.НазваниеСклада);
				Сообщение.Сообщить();
				
				ЗаписьЖурналаРегистрации(СтрШаблон("Ошибка при удалении сопоставления склада с уникальным идентификатором: %1 и названием: %2", 
													Стр.УникальныйИдентификаторСклада, Стр.НазваниеСклада), УровеньЖурналаРегистрации.Ошибка,,,ОписаниеОшибки(),);
			
			КонецПопытки;
		
		КонецЦикла;
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Удаление сопоставления складов завершено";
		Сообщение.Сообщить();
		
	КонецЕсли;	
	
	Возврат СопоставленныеСклады;

КонецФункции

#КонецОбласти
